lkolbly/cmsis-svd/data/TexasInstruments/LM3S2678.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTE</name>
      <prependToName>GPIO_PORTE</prependToName>
      <baseAddress>0x40024000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>Register map for PWM0 peripheral</description>
      <groupName>PWM</groupName>
      <prependToName>PWM0</prependToName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>PWM Master Control</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>PWM_CTL_GLOBALSYNC0</name>
              <description>Update PWM Generator 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_CTL_GLOBALSYNC1</name>
              <description>Update PWM Generator 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <description>PWM Time Base Sync</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>PWM_SYNC_SYNC0</name>
              <description>Reset Generator 0 Counter</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_SYNC_SYNC1</name>
              <description>Reset Generator 1 Counter</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>PWM Output Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>PWM_ENABLE_PWM0EN</name>
              <description>PWM0 Output Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM1EN</name>
              <description>PWM1 Output Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM2EN</name>
              <description>PWM2 Output Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_ENABLE_PWM3EN</name>
              <description>PWM3 Output Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INVERT</name>
          <description>PWM Output Inversion</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>PWM_INVERT_PWM0INV</name>
              <description>Invert PWM0 Signal</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM1INV</name>
              <description>Invert PWM1 Signal</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM2INV</name>
              <description>Invert PWM2 Signal</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_INVERT_PWM3INV</name>
              <description>Invert PWM3 Signal</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT</name>
          <description>PWM Output Fault</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>PWM_FAULT_FAULT0</name>
              <description>PWM0 Fault</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT1</name>
              <description>PWM1 Fault</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT2</name>
              <description>PWM2 Fault</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_FAULT_FAULT3</name>
              <description>PWM3 Fault</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>PWM Interrupt Enable</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>PWM_INTEN_INTPWM0</name>
              <description>PWM0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTPWM1</name>
              <description>PWM1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT0</name>
              <description>Interrupt Fault 0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_INTEN_INTFAULT1</name>
              <description>Interrupt Fault 1</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>PWM Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>PWM_RIS_INTPWM0</name>
              <description>PWM0 Interrupt Asserted</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTPWM1</name>
              <description>PWM1 Interrupt Asserted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT0</name>
              <description>Interrupt Fault PWM 0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_RIS_INTFAULT1</name>
              <description>Interrupt Fault PWM 1</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <description>PWM Interrupt Status and Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>PWM_ISC_INTPWM0</name>
              <description>PWM0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTPWM1</name>
              <description>PWM1 Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT0</name>
              <description>FAULT0 Interrupt Asserted</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_ISC_INTFAULT1</name>
              <description>FAULT1 Interrupt Asserted</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>PWM Status</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>PWM_STATUS_FAULT0</name>
              <description>Generator 0 Fault Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_STATUS_FAULT1</name>
              <description>Generator 1 Fault Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULTVAL</name>
          <description>PWM Fault Condition Value</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>PWM_FAULTVAL_PWM0</name>
              <description>PWM0 Fault Value</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM1</name>
              <description>PWM1 Fault Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM2</name>
              <description>PWM2 Fault Value</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_FAULTVAL_PWM3</name>
              <description>PWM3 Fault Value</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_CTL</name>
          <description>PWM0 Control</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>PWM_X_CTL_ENABLE</name>
              <description>PWM Block Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_MODE</name>
              <description>Counter Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_DEBUG</name>
              <description>Debug Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_LOADUPD</name>
              <description>Load Register Update Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_CMPAUPD</name>
              <description>Comparator A Update Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_CMPBUPD</name>
              <description>Comparator B Update Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_GENAUPD</name>
              <description>PWMnGENA Update Mode</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_CTL_GENAUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_GENAUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_GENAUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_CTL_GENBUPD</name>
              <description>PWMnGENB Update Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_CTL_GENBUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_GENBUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_GENBUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_CTL_DBCTLUPD</name>
              <description>PWMnDBCTL Update Mode</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBCTLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBCTLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBCTLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_CTL_DBRISEUPD</name>
              <description>PWMnDBRISE Update Mode</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBRISEUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBRISEUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBRISEUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_CTL_DBFALLUPD</name>
              <description>PWMnDBFALL Update Mode</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBFALLUPD_I</name>
                  <description>Immediate</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBFALLUPD_LS</name>
                  <description>Locally Synchronized</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_X_CTL_DBFALLUPD_GS</name>
                  <description>Globally Synchronized</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_X_CTL_FLTSRC</name>
              <description>Fault Condition Source</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWM_X_CTL_LATCH</name>
              <description>Latch Fault Input</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_INTEN</name>
          <description>PWM0 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>PWM_X_INTEN_INTCNTZERO</name>
              <description>Interrupt for Counter=0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCNTLOAD</name>
              <description>Interrupt for Counter=PWMnLOAD</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPAU</name>
              <description>Interrupt for Counter=PWMnCMPA Up</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPAD</name>
              <description>Interrupt for Counter=PWMnCMPA Down</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPBU</name>
              <description>Interrupt for Counter=PWMnCMPB Up</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_INTCMPBD</name>
              <description>Interrupt for Counter=PWMnCMPB Down</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCNTZERO</name>
              <description>Trigger for Counter=0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCNTLOAD</name>
              <description>Trigger for Counter=PWMnLOAD</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPAU</name>
              <description>Trigger for Counter=PWMnCMPA Up</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPAD</name>
              <description>Trigger for Counter=PWMnCMPA Down</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPBU</name>
              <description>Trigger for Counter=PWMnCMPB Up</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PWM_X_INTEN_TRCMPBD</name>
              <description>Trigger for Counter=PWMnCMPB Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_RIS</name>
          <description>PWM0 Raw Interrupt Status</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>PWM_X_RIS_INTCNTZERO</name>
              <description>Counter=0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCNTLOAD</name>
              <description>Counter=Load Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPAU</name>
              <description>Comparator A Up Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPAD</name>
              <description>Comparator A Down Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPBU</name>
              <description>Comparator B Up Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_RIS_INTCMPBD</name>
              <description>Comparator B Down Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_ISC</name>
          <description>PWM0 Interrupt Status and Clear</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_ISC_INTCNTZERO</name>
              <description>Counter=0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCNTLOAD</name>
              <description>Counter=Load Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPAU</name>
              <description>Comparator A Up Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPAD</name>
              <description>Comparator A Down Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPBU</name>
              <description>Comparator B Up Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_X_ISC_INTCMPBD</name>
              <description>Comparator B Down Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_LOAD</name>
          <description>PWM0 Load</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>PWM_X_LOAD</name>
              <description>Counter Load Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_COUNT</name>
          <description>PWM0 Counter</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>PWM_X_COUNT</name>
              <description>Counter Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_CMPA</name>
          <description>PWM0 Compare A</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>PWM_X_CMPA</name>
              <description>Comparator A Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_CMPB</name>
          <description>PWM0 Compare B</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>PWM_X_CMPB</name>
              <description>Comparator B Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
