lkolbly/cmsis-svd/data/TexasInstruments/LM3S2678.svd
        <register>
          <name>FAULT_STAT</name>
          <description>Configurable Fault Status</description>
          <addressOffset>0x00000D28</addressOffset>
          <fields>
            <field>
              <name>NVIC_FAULT_STAT_IERR</name>
              <description>Instruction Access Violation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_DERR</name>
              <description>Data Access Violation</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MUSTKE</name>
              <description>Unstack Access Violation</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MSTKE</name>
              <description>Stack Access Violation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_MMARV</name>
              <description>Memory Management Fault Address Register Valid</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_IBUS</name>
              <description>Instruction Bus Error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_PRECISE</name>
              <description>Precise Data Bus Error</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_IMPRE</name>
              <description>Imprecise Data Bus Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BUSTKE</name>
              <description>Unstack Bus Fault</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BSTKE</name>
              <description>Stack Bus Fault</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_BFARV</name>
              <description>Bus Fault Address Register Valid</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_UNDEF</name>
              <description>Undefined Instruction Usage Fault</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_INVSTAT</name>
              <description>Invalid State Usage Fault</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_INVPC</name>
              <description>Invalid PC Load Usage Fault</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_NOCP</name>
              <description>No Coprocessor Usage Fault</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_UNALIGN</name>
              <description>Unaligned Access Usage Fault</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NVIC_FAULT_STAT_DIV0</name>
              <description>Divide-by-Zero Usage Fault</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HFAULT_STAT</name>
          <description>Hard Fault Status</description>
          <addressOffset>0x00000D2C</addressOffset>
          <fields>
            <field>
              <name>NVIC_HFAULT_STAT_VECT</name>
              <description>Vector Table Read Fault</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_HFAULT_STAT_FORCED</name>
              <description>Forced Hard Fault</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>NVIC_HFAULT_STAT_DBG</name>
              <description>Debug Event</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_STAT</name>
          <description>Debug Status Register</description>
          <addressOffset>0x00000D30</addressOffset>
          <fields>
            <field>
              <name>NVIC_DEBUG_STAT_HALTED</name>
              <description>Halt request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_BKPT</name>
              <description>Breakpoint instruction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_DWTTRAP</name>
              <description>DWT match</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_VCATCH</name>
              <description>Vector catch</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DEBUG_STAT_EXTRNL</name>
              <description>EDBGRQ asserted</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MM_ADDR</name>
          <description>Memory Management Fault Address</description>
          <addressOffset>0x00000D34</addressOffset>
          <fields>
            <field>
              <name>NVIC_MM_ADDR</name>
              <description>Fault Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FAULT_ADDR</name>
          <description>Bus Fault Address</description>
          <addressOffset>0x00000D38</addressOffset>
          <fields>
            <field>
              <name>NVIC_FAULT_ADDR</name>
              <description>Fault Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <description>MPU Type</description>
          <addressOffset>0x00000D90</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_TYPE_SEPARATE</name>
              <description>Separate or Unified MPU</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_TYPE_DREGION</name>
              <description>Number of D Regions</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_TYPE_IREGION</name>
              <description>Number of I Regions</description>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <description>MPU Control</description>
          <addressOffset>0x00000D94</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_CTRL_ENABLE</name>
              <description>MPU Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_CTRL_HFNMIENA</name>
              <description>MPU Enabled During Faults</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_CTRL_PRIVDEFEN</name>
              <description>MPU Default Region</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_NUMBER</name>
          <description>MPU Region Number</description>
          <addressOffset>0x00000D98</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_NUMBER</name>
              <description>MPU Region to Access</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE</name>
          <description>MPU Region Base Address</description>
          <addressOffset>0x00000D9C</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR</name>
          <description>MPU Region Attribute and Size</description>
          <addressOffset>0x00000DA0</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_32B</name>
                  <description>Region size 32 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_64B</name>
                  <description>Region size 64 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_128B</name>
                  <description>Region size 128 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_256B</name>
                  <description>Region size 256 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_512B</name>
                  <description>Region size 512 bytes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_1K</name>
                  <description>Region size 1 Kbytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_2K</name>
                  <description>Region size 2 Kbytes</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_4K</name>
                  <description>Region size 4 Kbytes</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_8K</name>
                  <description>Region size 8 Kbytes</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_16K</name>
                  <description>Region size 16 Kbytes</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_32K</name>
                  <description>Region size 32 Kbytes</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_64K</name>
                  <description>Region size 64 Kbytes</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_128K</name>
                  <description>Region size 128 Kbytes</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_256K</name>
                  <description>Region size 256 Kbytes</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_512K</name>
                  <description>Region size 512 Kbytes</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_1M</name>
                  <description>Region size 1 Mbytes</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_2M</name>
                  <description>Region size 2 Mbytes</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_4M</name>
                  <description>Region size 4 Mbytes</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_8M</name>
                  <description>Region size 8 Mbytes</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_16M</name>
                  <description>Region size 16 Mbytes</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_32M</name>
                  <description>Region size 32 Mbytes</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_64M</name>
                  <description>Region size 64 Mbytes</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_128M</name>
                  <description>Region size 128 Mbytes</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_256M</name>
                  <description>Region size 256 Mbytes</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_512M</name>
                  <description>Region size 512 Mbytes</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_1G</name>
                  <description>Region size 1 Gbytes</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_2G</name>
                  <description>Region size 2 Gbytes</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SIZE_4G</name>
                  <description>Region size 4 Gbytes</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_0</name>
                  <description>Sub-region 0 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_1</name>
                  <description>Sub-region 1 disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_2</name>
                  <description>Sub-region 2 disable</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_3</name>
                  <description>Sub-region 3 disable</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_4</name>
                  <description>Sub-region 4 disable</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_5</name>
                  <description>Sub-region 5 disable</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_6</name>
                  <description>Sub-region 6 disable</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_SRD_7</name>
                  <description>Sub-region 7 disable</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_NO_NO</name>
                  <description>prv: no access, usr: no access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RW_NO</name>
                  <description>prv: rw, usr: none</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RW_RO</name>
                  <description>prv: rw, usr: read-only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RW_RW</name>
                  <description>prv: rw, usr: rw</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RO_NO</name>
                  <description>prv: ro, usr: none</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_MPU_ATTR_AP_RO_RO</name>
                  <description>prv: ro, usr: ro</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE1</name>
          <description>MPU Region Base Address Alias 1</description>
          <addressOffset>0x00000DA4</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE1_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR1</name>
          <description>MPU Region Attribute and Size Alias 1</description>
          <addressOffset>0x00000DA8</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR1_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
